       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TOPACCTS.
       AUTHOR.        BNDRA.
      *
       ENVIRONMENT DIVISION.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO INPTFILE.
           SELECT OUT-FILE ASSIGN TO OUTPFILE.
           SELECT SRT-FILE ASSIGN TO SORTFILE.
           SELECT TMP-FILE ASSIGN TO TEMPFILE.

       DATA DIVISION.
       FILE SECTION.
       FD OUT-FILE RECORD CONTAINS 80 CHARACTERS RECORDING MODE F.
       01 HEADER.
           05 REPORT-TITLE PIC X(80) VALUE SPACES.
       01 TIMER.
           05 TIMESTAMP PIC X(80) VALUE SPACES.
       01 COUNTER.
           05 REC-TEXT PIC X(14) VALUE SPACES.
           05 REC-COUNT PIC X(66) VALUE SPACES.
       01 FORMAT.
           05 FIRSTN-O    PIC X(11)   VALUE SPACES.
           05 LASTN-O     PIC X(22)   VALUE SPACES.
           05 BALANCE-O   PIC 9(12)   VALUE 0.
           05 FILL-O      PIC X(35)   VALUE SPACES.

       FD IN-FILE RECORD CONTAINS 80 CHARACTERS RECORDING MODE F.
       01 FIELDS.
           05 FIRSTN   PIC X(11).
           05 LASTN    PIC X(22).
           05 MISC     PIC X(28).
           05 BALANCE  PIC 9(12).

       SD SRT-FILE RECORD CONTAINS 80 CHARACTERS.
       01 SRT-FORM.
           05 FIRSTN-S   PIC X(11).
           05 LASTN-S    PIC X(22).
           05 MISC-S     PIC X(28).
           05 BALANCE-S  PIC 9(12).

       FD TMP-FILE RECORD CONTAINS 80 CHARACTERS RECORDING MODE F.
       01 TMP-FORM.
           05 FIRSTN-T   PIC X(11).
           05 LASTN-T    PIC X(22).
           05 MISC-T     PIC X(28).
           05 BALANCE-T  PIC 9(12).

       WORKING-STORAGE SECTION.

       01  PGM-VARIABLES.
           05 LASTREC PIC X(1) VALUE SPACES.
           05 THRESHHOLD PIC 9(7)V99 VALUE 8500000.00.
           05 ETHRESH PIC 9,999,999.99.
           05 CUST-COUNT PIC 9(3).
           05 YYYYMMDD PIC 9(8).

       PROCEDURE DIVISION.

       A000-START.
           MOVE THRESHHOLD TO ETHRESH.

           SORT SRT-FILE ON DESCENDING KEY BALANCE-S
           USING IN-FILE GIVING TMP-FILE.

           OPEN INPUT TMP-FILE.
           OPEN OUTPUT OUT-FILE.

           PERFORM A000-READ-NEXT.
           PERFORM A000-WRITE-HEADER.
           CLOSE TMP-FILE.
           CLOSE OUT-FILE.

           STOP RUN.

       A000-READ-NEXT.
           PERFORM A000-READ-RECORD
           DISPLAY BALANCE-T
           DISPLAY ETHRESH
           PERFORM UNTIL LASTREC = 'Y'
           ADD 1 TO CUST-COUNT
           PERFORM A000-WRITE-RECORD
           PERFORM A000-READ-RECORD
           END-PERFORM
           .
       A000-READ-RECORD.
           READ TMP-FILE
           AT END MOVE 'Y' TO LASTREC
           END-READ.
           IF BALANCE-T < ETHRESH THEN
              MOVE 'Y' TO LASTREC
           END-IF.

       A000-WRITE-RECORD.
           MOVE FIRSTN-T    TO FIRSTN-O.
           MOVE LASTN-T     TO LASTN-O.
           MOVE BALANCE-T   TO BALANCE-O.
           MOVE "    "    TO FILL-O.
           WRITE FORMAT.

       A000-WRITE-HEADER.
           MOVE "REPORT OF TOP ACCOUNT BALANCE HOLDERS" TO REPORT-TITLE.
           WRITE HEADER.
           MOVE FUNCTION CURRENT-DATE(1:8) TO YYYYMMDD.
           MOVE YYYYMMDD         TO TIMESTAMP.
           WRITE TIMER.
           MOVE "# OF RECORDS: " TO REC-TEXT.
           MOVE CUST-COUNT TO REC-COUNT.
           WRITE COUNTER.
